{
    "pageTitle" : "What's Neptune",
    "sectionTitle" : ["The Idea", "Some Background {gradient-code}"],
    "headings" : ["Neptune is a set of tools to help you develope your front-end application faster and easier.", "The idea behind Neptune is make developement more human friendly.", "Goal"],
    "bodies" : ["It's comprised of 2 libraries, one for the structure called neptunes-components and one for the styling called neptunes-styles. Neptunes-components is written in react, and neptunes-styles is written in scss.", "Although they are written in order to work together you can use them separately if that's what you need.", "Neptune-components integrates a certain level of data description. I'm are aware of the inconvenience and plan to develope a better solution in this regard. Till then I wrote some rules that will make props naming easy to handle and remember (hopefully).", "Nonetheless there's an available file that you can copy and use as reference.", "On top of that there's a provided program that allows you to save time by dealing with import syntax for icons, fonts, or to define values like hue and sizes (and therefore saving palette description as well)", "Thanks to that you can write a front-end almost entirely from the back-end.", "Addtionally a GUI to help with the first file structure is in developement and expected to be launched soon. Check the blog section to find out more and subscribe to the newsletter to not miss any update.", "with such descriptive languages like HTML and CSS there's still a lvl of abstraction. What's an <h1>? An <h1> could be anything.  But what's a <SectionTitle />?  I feel the 'abstraction level' of sintactic HTML can still create a gap in the developement and lead sometimes to missunderstandings.", "Build a UI/UX components library that comprehends React and SCSS components.", "This components must be written in such a way that are easy to edit, maintain and scale.", "Since the whole project is focused on UI / UX, the comunication between Designers and Programers is easier, and has always the User in mind."]
}